#### How To Fix Incomplete Data

In [4]:
import pandas as pd
import numpy as np
# create dummy data
stuff= {'A':[1,2,3], 'B':[4,np.nan,6], 'C':[7,8,9] ,'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [5]:
#drop rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [6]:
# drop columns with null data
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [ ]:
#not permanant, inplace=True
# my_df.dropna(inplace=True)

In [10]:
# more than one? set threshold
stuff= {'A':[1,2,3], 'B':[4,np.nan,np.nan], 'C':[7,8,9] ,'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

my_df.dropna(thresh=2,axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [11]:
#replace null_data with fillna()
my_df.fillna(value=-9999999)

   A          B  C   D
0  1        4.0  7  10
1  2 -9999999.0  8  11
2  3 -9999999.0  9  12

In [13]:
#use math function
stuff= {'A':[1,2,3], 'B':[4,np.nan,6], 'C':[7,8,9] ,'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df
my_df.fillna(value=my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [14]:
#use min max
my_df.fillna(value=my_df['B'].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12

In [15]:
#use sum
my_df.fillna(value=my_df['B'].sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12